{"title": "Illustrated Guide to Python 3", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/f7606aaacf3dc888d49e252066237315dbd8e2101c233da70e2eec18a333791e.jpg", "author": "Matt Harrison", "desc": "Introducing Your Guide to Learning PythonIllustrated Guide to Learning Python is designed to bring developers and others who are anxious to learn Python up to speed quickly. Not only does it teach the basics of syntax, but it condenses years of experience. You will learn warts, gotchas, best practices and hints that have been gleaned through the years in days. You will hit the ground running and running in the right way.Learn Python QuicklyPython is an incredible language. It is powerful and applicable in many areas. It is used for automation of simple or complex tasks, numerical processing, web development, interactive games and more. Whether you are a programmer coming to Python from another language, managing Python programmers or wanting to learn to program, it makes sense to cut to the chase and learn Python the right way. You could scour blogs, websites and much longer tomes if you have time. Treading on Python lets you learn the hints and tips to be Pythonic quickly.Packed with Useful Hints and TipsYou'll learn the best practices without wasting time searching or trying to force Python to be like other languages. I've collected all the gems I've gleaned over years of writing and teaching Python for you.A No Nonsense Guide to Mastering Basic PythonPython is a programming language that lets you work more quickly and integrate your systems more effectively. You can learn to use Python and see almost immediate gains in productivity and lower maintenance costs.What you will learn: Distilled best practices and tips How interpreted languages work Using basic types such as Strings, Integers, and Floats Best practices for using the interpreter during development The difference between mutable and immutable data Sets, Lists, and Dictionaries, and when to use each Gathering keyboard input How to define a class Looping constructs Handling Exceptions in code Slicing sequences Creating modular code Using libraries Laying out code Community prescribed conventions", "Categories": "Computers - Programming", "Year": "2017", "Edition": "2", "Publisher": "Createspace Independent Publishing Platform", "Language": "english", "Pages": "256", "File": "EPUB, 3.12 MB", "IPFS_CID": "QmNWUvSZWsYXhjt79YoMLUR9xsFiCJadhRJLfdJnwmnsGu", "IPFS_CID_blake2b": "bafykbzacebmolse7iyq3rcjqxagx3unuxwsuwqh7qbdrzutot2pivjnga5z4q"}