{"title": "The Sixth Extinction: An Unnatural History", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/foreignfiction/d3a1b0b6107bd5de78a5d2d1fe171ff2f68b54c2f9edb24628e08be1e757a918.png", "author": "Elizabeth Kolbert", "desc": "A major book about the future of the world, blending intellectual and natural history and field reporting into a powerful account of the mass extinction unfolding before our eyes\"Elizabeth Kolbert writes with an aching beauty of the impact of our species on all the other forms of life known in this cold universe. The perspective is at once awe-inspiring, humbling and deeply necessary.\"   -  T.C. BoyleOver the last half a billion years, there have been five mass extinctions, when the diversity of life on earth suddenly and dramatically contracted. Scientists around the world are currently monitoring the sixth extinction, predicted to be the most devastating extinction event since the asteroid impact that wiped out the dinosaurs. This time around, the cataclysm is us.In The Sixth Extinction, two-time winner of the National Magazine Award and New Yorker writer Elizabeth Kolbert draws on the work of scores of researchers in half a dozen disciplines, accompanying many of them into the field: geologists who study deep ocean cores, botanists who follow the tree line as it climbs up the Andes, marine biologists who dive off the Great Barrier Reef. She introduces us to a dozen species, some already gone, others facing extinction, including the Panamian golden frog, staghorn coral, the great auk, and the Sumatran rhino. Through these stories, Kolbert provides a moving account of the disappearances occurring all around us and traces the evolution of extinction as a concept, from its first articulation by Georges Cuvier in revolutionary Paris up through the present day.\"Powerful... Kolbert expertly traces the ‘twisting’ intellectual history of how we’ve come to understand the concept of extinction, and more recently, how we’ve come to recognize our role in it... An invaluable contribution to our understanding of present circumstances.\"  -  Al Gore, The New York Tim", "Categories": "Earth Sciences - The Environment", "Year": "2014", "Publisher": "Henry Holt and Company", "Language": "english", "Pages": "336", "File": "EPUB, 1.89 MB", "IPFS_CID": "QmQkm1RoQFcJ8HDDdMB1VdiFFief8ELTcQHp6fe1jFDnSx", "IPFS_CID_blake2b": "bafykbzaceap2gp4jpf4lzkrv3eysgwh3aq5hu5rxjjs6zyrkgnzlvngenn2l6"}