{"title": "The Economics Book", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/5675cd4ab3131d7603cc3b564ca3caaa9438816176e06a8ffc48a7f70634a185.jpg", "author": "DK", "desc": "Learn about trade and global economic crises in The Economics Book. Part of the fascinating Big Ideas series, this book tackles tricky topics and themes in a simple and easy to follow format. Learn about Economics in this overview guide to the subject, great for novices looking to find out more and experts wishing to refresh their knowledge alike! The Economics Book brings a fresh and vibrant take on the topic through eye-catching graphics and diagrams to immerse yourself in. This captivating book will broaden your understanding of Economics, with: - More than 100 of the greatest ideas in economics - Packed with facts, charts, timelines and graphs to help explain core concepts - A visual approach to big subjects with striking illustrations and graphics throughout - Easy to follow text makes topics accessible for people at any level of understanding The Economics Book is a captivating introduction to historically important and emerging ideas in a field of science that often confuses newcomers, aimed at adults with an interest in the subject and students wanting to gain more of an overview. Here you’ll discover more than 100 of the greatest ideas, from the earliest experiences of trade to global economic crises, through exciting text and bold graphics. Your Economics Questions, Simply Explained This fresh new guide examines everything from the current financial climate of markets in turmoil and whole economies in melt-down. If you thought it was difficult to learn about this field of science, The Economics Book presents key information in a clear layout. From the earliest development of private property to the cutting-edge modern game theory, learn about centuries of economic thought, making clear even the most complex of concepts. The Big Ideas Series With millions of copies sold worldwide, The Economics Book is part of the award-winning Big Ideas series from DK. The series uses striking graphics along with engaging writing, making big topics easy to understand.", "Categories": "Business & Economics - Popular", "Year": "2013", "Edition": "01", "Publisher": "National Geographic Books", "Language": "english", "Pages": "355 / 354", "File": "PDF, 39.26 MB", "IPFS_CID": "QmVgCSKYwgNwfR7DcQwd2U8W6YTVXNDp7vV4KcoNGz2MNc", "IPFS_CID_blake2b": "bafykbzacebbmkgqd2xbo72pwxwsyxw3col5us4fphlvllttseavgba4prkoys", "Series": "Big Ideas Simply Explained"}