{"title": "Rich Dad Poor Dad", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/1156ee47d6d2f07ed70ee2f53c8711f99e1d5c629fb324c3d82f3725c7a8ea95.jpg", "author": "Robert T. Kiyosaki", "desc": "April 2017 marks 20 years since Robert Kiyosaki's Rich Dad Poor Dad first made waves in the Personal Finance arena. It has since become the #1 Personal Finance book of all time... translated into dozens of languages and sold around the world. Rich Dad Poor Dad is Robert's story of growing up with two dads -- his real father and the father of his best friend, his rich dad -- and the ways in which both men shaped his thoughts about money and investing. The book explodes the myth that you need to earn a high income to be rich and explains the difference between working for money and having your money work for you. 20 Years... 20/20 Hindsight In the 20th Anniversary Edition of this classic, Robert offers an update on what we've seen over the past 20 years related to money, investing, and the global economy. Sidebars throughout the book will take readers \"fast forward\" -- from 1997 to today -- as Robert assesses how the principles taught by his rich dad have stood the test of time. In many ways, the messages of Rich Dad Poor Dad, messages that were criticized and challenged two decades ago, are more meaningful, relevant and important today than they were 20 years ago. As always, readers can expect that Robert will be candid, insightful... and continue to rock more than a few boats in his retrospective. Will there be a few surprises? Count on it.Rich Dad Poor Dad... * Explodes the myth that you need to earn a high income to become rich * Challenges the belief that your house is an asset * Shows parents why they can't rely on the school system to teach their kids about money * Defines once and for all an asset and a liability * Teaches you what to teach your kids about money for their future financial success", "Categories": "Business & Economics - Personal Finance", "Year": "2017", "Edition": "1", "Publisher": "Plata Publishing", "Language": "english", "Pages": "336", "File": "EPUB, 5.71 MB", "IPFS_CID": "QmTNmckd3KQB6tG1bxmuuetsz8Gkkr5xdiQD8KgB3QCJwY", "IPFS_CID_blake2b": "bafykbzaceddzabwk4v44kr2xv5lr32y4uwoek6annt672jjciitovalk3cias", "Series": "1"}