{"title": "Coding Theory", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/bb5819fe01b8a397151aeae7f052ef2328d116f1423ee64d504300ee6e8c837c.jpg", "author": "Andre Neubauer", "desc": "One of the most important key technologies for digital communication systems as well as storage media is coding theory. It provides a means to transmit information across time and space over noisy and unreliable communication channels. Coding Theory: Algorithms, Architectures and Applications provides a concise overview of channel coding theory and practice, as well as the accompanying signal processing architectures. The book is unique in presenting algorithms, architectures, and applications of coding theory in a unified framework. It covers the basics of coding theory before moving on to discuss algebraic linear block and cyclic codes, turbo codes and low density parity check codes and space-time codes. Coding Theory provides algorithms and architectures used for implementing coding and decoding strategies as well as coding schemes used in practice especially in communication systems. Feature of the book include: Unique presentation-like style for summarising main aspects Practical issues for implementation of coding techniques Sound theoretical approach to practical, relevant coding methodologies Covers standard coding schemes such as block and convolutional codes, coding schemes such as Turbo and LDPC codes, and space time codes currently in research, all covered in a common framework with respect to their applications. This book is ideal for postgraduate and undergraduate students of communication and information engineering, as well as computer science students. It will also be of use to engineers working in the industry who want to know more about the theoretical basics of coding theory and their application in currently relevant communication systems", "Categories": "Computers - Programming", "Year": "2007", "Publisher": "Wiley-Interscience", "Language": "english", "Pages": "355", "File": "PDF, 1.59 MB", "IPFS_CID": "QmXe9THnBdzWG96Kt2dpjJYYFWzPGwpPMNBuggkxmQXzzb", "IPFS_CID_blake2b": "bafykbzaced7q2ny53txfsvvc5caiavmwwpajsa77tdrnkhfjyiwkyi4sc5eva"}