{"title": "Underland: A Deep Time Journey", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/ec76694bcdfd415177fdeffdab099a9815697346e0c04f35208a53ff298ccec8.jpg", "author": "Robert Macfarlane", "desc": "Hailed as \"the great nature writer of this generation\" (Wall Street Journal), Robert Macfarlane is the celebrated author of books about the intersections of the human and the natural realms. “Robert Macfarlane is a magician with words. In Underland he shows us how to see in the dark. His writing is like a vortex…once caught, you’re pulled deeper and deeper with each page.”  -  Andrea WulfIn Underland, he delivers his masterpiece: an epic exploration of the Earth's underworlds as they exist in myth, literature, memory, and the land itself. In this highly anticipated sequel to his international bestseller The Old Ways, Macfarlane takes us on an extraordinary journey into our relationship with darkness, burial, and what lies beneath the surface of both place and mind. “I began this book with the thrill of realizing that Robert Macfarlane has over the years and books charted the heights and breadth of human travel before plumbing the depths in this exquisite book about what lies beneath. I ended it with wonder at his ability to evoke so vividly places to which I and probably you will never go, and the sense of vast scale they restore to us at a time when it can feel like the world has shrunken around us.”-  Rebecca SolnitGlobal in its geography and written with great lyricism and power, Underland speaks powerfully to our present moment. Taking a deep-time view of our planet, Macfarlane here asks a vital and unsettling question: \"Are we being good ancestors to the future Earth?\"", "Categories": "Earth Sciences - The Environment", "Year": "2019", "Edition": "Hardcover", "Publisher": "W.W. Norton & Company", "Language": "english", "Pages": "384", "File": "EPUB, 15.74 MB", "IPFS_CID": "QmNwVsUnmtxWFPVUxrYDj8LL1xJXGkpjdowzABe2BURc3A", "IPFS_CID_blake2b": "bafykbzaceapaxahvfi26lo2a43a6kskvrcvz4kxbqpzxbkdq45uhfqwpwb43q"}