{"title": "Linux Basics for Hackers", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/35d3105397cb82ad3b048b9b15249df0bdedbf844e2af3a56df7c0447f39c4be.jpg", "author": "OccupyTheWeb", "desc": "This practical, tutorial-style book uses the Kali Linux distribution to teach Linux basics with a focus on how hackers would use them. Topics include Linux command line basics, filesystems, networking, BASH basics, package management, logging, and the Linux kernel and drivers. If you're getting started along the exciting path of hacking, cybersecurity, and pentesting, Linux Basics for Hackers is an excellent first step. Using Kali Linux, an advanced penetration testing distribution of Linux, you'll learn the basics of using the Linux operating system and acquire the tools and techniques you'll need to take control of a Linux environment. First, you'll learn how to install Kali on a virtual machine and get an introduction to basic Linux concepts. Next, you'll tackle broader Linux topics like manipulating text, controlling file and directory permissions, and managing user environment variables. You'll then focus in on foundational hacking concepts like security and anonymity and learn scripting skills with bash and Python. Practical tutorials and exercises throughout will reinforce and test your skills as you learn how to: - Cover your tracks by changing your network information and manipulating the rsyslog logging utility - Write a tool to scan for network connections, and connect and listen to wireless networks - Keep your internet activity stealthy using Tor, proxy servers, VPNs, and encrypted email - Write a bash script to scan open ports for potential targets - Use and abuse services like MySQL, Apache web server, and OpenSSH - Build your own hacking tools, such as a remote video spy camera and a password cracker Hacking is complex, and there is no single way in. Why not start at the beginning with Linux Basics for Hackers?", "Categories": "Computers - Security", "Year": "2018", "Edition": "Paperback", "Publisher": "No Starch Press", "Language": "english", "Pages": "249 / 254", "File": "PDF, 14.24 MB", "IPFS_CID": "QmdG1NfioKrwGyfqo4Nwr6FfudhL5v6zvKfRzz9cZVwPFT", "IPFS_CID_blake2b": "bafykbzaceajgsm3p6kvr7ns43fcoqaj35zp56mcz2neop5vzqg5hh74cb2ye2"}