{"title": "Optimization modelling: a practical approach", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/73b2d10f624cfd4c1101327271bcbecdb8eb9a354607d87d35e2129aedea5224.jpg", "author": "Ruhul Amin Sarker", "desc": "Although a useful and important tool, the potential of mathematical modelling for decision making is often neglected. Considered an art by many and weird science by some, modelling is not as widely appreciated in problem solving and decision making as perhaps it should be. And although many operations research, management science, and optimization books touch on modelling techniques, the short shrift they usually get in coverage is reflected in their minimal application to problems in the real world. Illustrating the important influence of modelling on the decision making process, Optimization Modelling: A Practical Approach helps you come to grips with a wide range of modelling techniques. Highlighting the modelling aspects of optimization problems, the authors present the techniques in a clear and straightforward manner, illustrated by examples. They provide and analyze the formulation and modelling of a number of well-known theoretical and practical problems and touch on solution approaches. The book demonstrates the use of optimization packages through the solution of various mathematical models and provides an interpretation of some of those solutions. It presents the practical aspects and difficulties of problem solving and solution implementation and studies a number of practical problems. The book also discusses the use of available software packages in solving optimization models without going into difficult mathematical details and complex solution methodologies. The emphasis on modelling techniques rather than solution algorithms sets this book apart. It is a single source for a wide range of methods, classic theoretical and practical problems, data collection and input preparation, the use of different optimization software, and practical issues of modelling, model solving, and implementation. The authors draw directly from their experience to provide lessons learned when applying modelling techniques to practical problem solving and implementation diffi", "Categories": "Engineering", "Year": "2008", "Edition": "1", "Publisher": "CRC Press", "Language": "english", "Pages": "504", "File": "PDF, 2.97 MB", "IPFS_CID": "QmXrDigT6cjMsUi5Xertxyw9nJCj4e7HKKu84KYnCAXB1z", "IPFS_CID_blake2b": "bafykbzacedh3r7hghvhifafrjyzssbtnczdda2bcubxxj5rknz5xlr6afrrpm"}