{"title": "Practical Electronics for Inventors, Fourth Edition", "imgLink": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/5e259fa655c6f67b8547314da9eeb9141321ba0c2874688b63f4ea28ae10fbef.jpg", "author": "Paul Scherz", "desc": "Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. A Fully-Updated, No-Nonsense Guide to Electronics Advance your electronics knowledge and gain the skills necessary to develop and construct your own functioning gadgets. Written by a pair of experienced engineers and dedicated hobbyists, Practical Electronics for Inventors, Fourth Edition, lays out the essentials and provides step-by-step instructions, schematics, and illustrations. Discover how to select the right components, design and build circuits, use microcontrollers and ICs, work with the latest software tools, and test and tweak your creations. This easy-to-follow book features new instruction on programmable logic, semiconductors, operational amplifiers, voltage regulators, power supplies, digital electronics, and more. Practical Electronics for Inventors, Fourth Edition, covers: Resistors, capacitors, inductors, and transformers Diodes, transistors, and integrated circuits Optoelectronics, solar cells, and phototransistors Sensors, GPS modules, and touch screens Op amps, regulators, and power supplies Digital electronics, LCD displays, and logic gates Microcontrollers and prototyping platforms Combinational and sequential programmable logic DC motors, RC servos, and stepper motors Microphones, audio amps, and speakers Modular electronics and prototypes", "Categories": "Engineering - Electrical & Electronic Engineering", "Year": "2016", "Edition": "4th", "Publisher": "McGraw-Hill Education TAB", "Language": "english", "Pages": "1056", "File": "PDF, 29.04 MB", "IPFS_CID": "QmS8j4etrR33UZaJ3rjZemz9tN61K49HTB52VNr83Fs2DU", "IPFS_CID_blake2b": "bafykbzacec54cpcj25kweezx7ziyj4z7hmzndfd5amtpvu547baqupht4gu7q"}